[
  {
    "model": "eduklub.teachingunit",
    "pk": 1,
    "fields": {
      "name": "Množiny",
      "description": "Množina je soubor objektů, chápaný jako celek. Objekty množiny se nazývají prvky množiny. Charakterizující vlastnost množiny je, že je jednoznačně určena svými prvky (ale nevšímá si jejich pořadí ani žádné další struktury). Množina, neobsahující žádné prvky se nazývá prázdná množina. V matematice existuje abstraktní teorie množin, zkoumající množiny z formálního hlediska.",
      "certificated": true,
      "creation_date": "2023-08-31",
      "number_of_lessons": 6,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 7,
      "grade": 1,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 2,
    "fields": {
      "name": "Lineární rovnice a nerovnice",
      "description": "Lineární nerovnice – vyřešené příklady pro střední a vysoké školy, cvičení, příprava na přijímací zkoušky na vysokou školu. Lineární nerovnice – vyřešené příklady pro střední a vysoké školy, cvičení, příprava na přijímací zkoušky na vysokou školu.Lineární nerovnice – vyřešené příklady pro střední a vysoké školy, cvičení, příprava na přijímací zkoušky na vysokou školu.Lineární nerovnice – vyřešené příklady pro střední a vysoké školy, cvičení, příprava na přijímací zkoušky na vysokou školu.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 4,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_9Ug7rfe.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 7,
      "grade": 18,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 3,
    "fields": {
      "name": "Analytická geometrie",
      "description": "Analytická geometrie (také souřadnicová geometrie nebo kartézská geometrie) je část geometrie, která zkoumá geometrické útvary v euklidovské geometrii pomocí algebraických a analytických metod.\r\n\r\nV analytické geometrii jsou geometrické útvary v prostoru vyjadřovány čísly a rovnicemi ve zvolených souřadnicových soustavách. Mnohé problémy analytické geometrie jsou úzce svázány s lineární algebrou.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 3,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_RGOn3ha.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 7,
      "grade": 16,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 4,
    "fields": {
      "name": "Goniometrie a trigonometrie",
      "description": "Goniometrie (z řeckého gónia = úhel a metró = měřím) je oblast matematiky, která se zabývá goniometrickými funkcemi jako sinus, kosinus, tangens a kotangens. Součástí goniometrie je trigonometrie. Ta se věnuje praktickému užití těchto funkcí při řešení různých úloh o trojúhelnících. V některých jazycích (např. v angličtině) pojem goniometrie nenajdete - pro tuto část matematiky používají označení trigonometrie. Goniometrie (z řeckého gónia = úhel a metró = měřím) je oblast matematiky, která se zabývá goniometrickými funkcemi jako sinus, kosinus, tangens a kotangens. Součástí goniometrie je trigonometrie. Ta se věnuje praktickému užití těchto funkcí při řešení různých úloh o trojúhelnících. V některých jazycích (např. v angličtině) pojem goniometrie nenajdete - pro tuto část matematiky používají označení trigonometrie.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 7,
      "number_of_downloads": 3,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_bWJT4C8.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 7,
      "grade": 10,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 5,
    "fields": {
      "name": "Německý jazyk - Slovesa",
      "description": "Na výše uvedeném slovesu kochen můžeme vidět, že při časování sloves ke kořenu infinitivu přidávají koncovky -e, -(e)st, -t, -en, -t, -en.\r\n\r\nSlovesa, jejichž kmen končí na souhlásky „t“, „d“, nebo u některých sloves, jejichž kmen končí na „n“ +“m“, vložíme mezi kmen a koncovku pomocné „e“, aby se sloveso lépe vyslovovalo. Příkladem můžeme uvést sloveso „reden“: du redest, er redet.\r\n\r\nKmeny sloves, které končí na sykavky (například: „s“, „ß“ nebo „ss“), jsou další výjimkou. Ve 2. osobě jednotného čísla se použije pouze koncovka „t“. Sloveso má pak v 2. a 3. osobě j.č. stejný tvar. Příkladem sloveso grüßen: ich grüße du grüßt, er grüßt.\r\n\r\nVykání\r\nStejně jako v češtině se i v němčině vyká, a to pomocí zájmene “Sie”, které se píše vždy s velkým písmenem. Tvar slovesa při vykání je stejný jako v 3. osobě množného čísla.\r\n\r\nWas machen Sie? – Co děláte? \r\nWissen Sie schon, was Sie bestellen werden? – Víte již, co si objednáte?\r\n\r\nČasování sloves se změnou v slovesném kořenu",
      "certificated": true,
      "creation_date": "2023-08-31",
      "number_of_lessons": 7,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_qvAhT6D.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 5,
      "grade": 11,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 6,
    "fields": {
      "name": "Německý jazyk - čísla",
      "description": "0 – 12 : null, eins, zwei, drei, vier, fünf, sechs, sieben, acht, neun, zehn, elf, zwölf\r\n\r\n13 – 19 :  dreizehn, vierzehn, fünfzehn, sechzehn, siebzehn, achtzehn, neunzehn\r\n\r\n20 – 90 : zwanzig, dreißig, vierzig, fünfzig, sechzig, siebzig, achtzig, neunzig\r\n\r\n100 – hundert, 101 - (ein) hundert (und) eins = einhundertundeins, 437 – vierhundertsiebenunddreißig",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 2,
      "number_of_downloads": 3,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_dmtES3b.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 5,
      "grade": 12,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 7,
    "fields": {
      "name": "Zájmena",
      "description": "Co jsou to vlastně zájmena? Zjednodušeně můžeme říct, že jsou to slova, která zastupují podstatná jména nebo na ně ukazují. Například abychom nemuseli stále opakovat jedno jméno, pomůžeme si zájmenem.\r\n\r\nMeine Mutter und mein Vater sind nach Hause gekommen. Sie waren sehr müde. – Moje maminka a můj tatínek přišli domů. Oni byli velice unavení.\r\nZájmena patří k ohebným slovním druhům. Znamená to, že je skloňujeme podle rodu, pádu a čísla podstatného jména, které nahrazují nebo ke kterému se vztahují.\r\n\r\nDas Buch gehört meiner Schwester. – Ta kniha patří mé sestře. (komu patří? – 3.pád)\r\nJednotlivé druhy zájmen si projdeme v následujících řádcích.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 4,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_xinLD55.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 5,
      "grade": 14,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 8,
    "fields": {
      "name": "Minulý čas",
      "description": "Minulý čas – perfektum\r\nExistují dva základní způsoby, jak v němčině vyjádřit minulost. Jeden je jednoduchý (préteritum – sloveso má jen jednu část) a druhý složený (perfektum – dvě části slovesa). Naneštěstí pro studenty je tím více využívaným způsobem ten o něco složitější, na který se dnes podíváme.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 1,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_0tn7NkN.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 5,
      "grade": 18,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 9,
    "fields": {
      "name": "Slovní zásoba",
      "description": "Seznamy nejčastěji používaných anglických slov\r\nAnglická slovní zásoba je velmi rozsáhlá – odhaduje se, že má okolo 250 000 rozdílných slov (a zhruba třikrát tolik různých významů slov). Od většiny učitelů angličtiny nicméně uslyšíte, že pokud zvládnete 3000 těch nejčastějších, dokážete porozumět anglickým novinám, knihám, filmům a rozhovorům z nějakých 90 až 95 %. A navíc – jakmile bude jednou vaše slovní zásoba takto velká, bude pro vás už snadné učit se nová slovíčka průběžně a jejich význam dokážete bez problémů z kontextu odhadnout sami. Je však potřeba vědět, která slova jsou ta nejčastější – abyste se učili to, co je doopravdy důležité, a neztráceli zbytečně čas.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 2,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_kOokqwo.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 2,
      "grade": 1,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 10,
    "fields": {
      "name": "Předložky",
      "description": "Využívá se u:\r\n\r\npřesnějšího určení menšího místa (např. u někoho doma, v kuchyni, v koupelně atd.)\r\npojí se s určitými body, adresou, oblastmi, celky, specifickým místem, polohou\r\nurčení přesného časového údaje „v kolik hodin“, části dne\r\npokud chceme říct, že věc je „v blízkosti něčeho“\r\nPříklady:\r\n\r\nAT jako předložka místa",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 1,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_14CWu0j.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 2,
      "grade": 3,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 11,
    "fields": {
      "name": "Diskuze",
      "description": "Angličtina jak se jí naučit\r\nAhoj všichni! Prosím o radu. V zaměstnání dochází k reorganizaci a bylo nám oznámeno, že nutností k práci je komunikativní angličtina. Sama jsem jí měla jen na základce, pak už ne. Jinou práci díky tomu nehledám, nemám šanci se ani někde uplatnit. Vím, že angličtinu chtějí všude. Problém je, že jsem věčná začátečnice. A pokud něčemu rozumím napsané, tak slovně vůbec. Jak se dá tenhle jazyk zvládnout bez toho, aniž by člověk odcestoval? Samoživitelka s malým dítětem, peněz moc nazbyt není, proto placené kurzy jsou taky mimo mísu. Dá se to nějak z domova zvládnout? Octnout se na dlažbě si neumím představit. Je fakt, že jsem si dlouhodobě říkala, že mě štve, jak anglicky neumím. A dělám hroznou chybu, když narazím na něco, co nevím, pořád se k tomu vracím a knížku začínám od první lekce, takže jedu jako šnek. Na hovor nerozumím ani ň. Chtěla bych to zlomit, i když jsem na jazyky totální dřevo. Jenže teď je to pro mě akutní, abych se do toho dala.\r\nRaději anonym, jsem prostě blbá.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 3,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_7X3bsBx.zip",
      "language": 2,
      "author": 2,
      "parent": null,
      "subject": 2,
      "grade": 9,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 12,
    "fields": {
      "name": "Popis obrázku",
      "description": "Popis obrázku se vyskytuje nejen u maturity, ale u mnoha zkoušek a certifikátů z angličtiny. Zadání je většinou velmi podobné, úkolem je popsat obrázek, porovnat dva obrázky a říct nějaké informace k jednomu všeobecnému tématu.\r\n\r\nMaturita z angličtiny a popis obrázku\r\n\r\nÚstní maturitní zkouška se skládá ze čtyř částí a věřte nebo ne, ale pokud se naučíte perfektně popis obrázku, naučíte se vlastně mnoho důležitých věcí i k těm ostatním částem.\r\n\r\nPojďme si tedy ukázat, jak se na popis obrázku nejlépe připravit, abyste znalosti mohli využít i ve zbývajících částech.\r\n\r\nCo tím získáte? Především čas, kterého je před maturitou tak málo, ale také se naučíte skvěle improvizovat.\r\n\r\nV tomto článku se dozvíte:\r\n\r\nCo dělat a co nedělat při popisu obrázku\r\nJaké fráze se naučit nazpaměť\r\nCo dělat, když neznám slovíčka\r\nJak postupovat při popisu (struktura)\r\nUžitečné tipy",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 3,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_obyOqw7.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 2,
      "grade": 17,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 13,
    "fields": {
      "name": "Hmotnost",
      "description": "Hmotnost je aditivní vlastnost hmoty (tedy vlastnost jednotlivých hmotných těles), která vyjadřuje míru setrvačných účinků či míru gravitačních účinků hmoty. Ekvivalence setrvačných a gravitačních sil je postulována obecnou teorií relativity a je s velkou přesností experimentálně ověřena.[1]\r\n\r\nHmotnost je obdobná charakteristika hmoty jako např. energie, elektrický náboj apod.Hmotnost je aditivní vlastnost hmoty (tedy vlastnost jednotlivých hmotných těles), která vyjadřuje míru setrvačných účinků či míru gravitačních účinků hmoty. Ekvivalence setrvačných a gravitačních sil je postulována obecnou teorií relativity a je s velkou přesností experimentálně ověřena.[1]\r\n\r\nHmotnost je obdobná charakteristika hmoty jako např. energie, elektrický náboj apod.Hmotnost je aditivní vlastnost hmoty (tedy vlastnost jednotlivých hmotných těles), která vyjadřuje míru setrvačných účinků či míru gravitačních účinků hmoty. Ekvivalence setrvačných a gravitačních sil je postulována obecnou teorií relativity a je s velkou přesností experimentálně ověřena.[1]\r\n\r\nHmotnost je obdobná charakteristika hmoty jako např. energie, elektrický náboj apod.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 3,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_0H1lu98.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 11,
      "grade": 11,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 14,
    "fields": {
      "name": "Síla",
      "description": "Síla je vektorová fyzikální veličina, která vyjadřuje míru vzájemného působení těles nebo polí. Jednotkou síly je newton se značkou N.\r\n\r\nÚvod\r\nSíla se projevuje statickými účinky – je příčinou deformace těles – a dynamickými účinky – je příčinou změny pohybového stavu tělesa (hmotného bodu), např. uvedení tělesa z klidu do pohybu nebo naopak, či změny velikosti nebo směru rychlosti tělesa. Taková změna je (v inerciální soustavě) vždy podmíněna působením jiných těles, ať už přímým dotykem (nárazem, třením, tažením, tlačením) nebo prostřednictvím silového pole. Toto působení je v Newtonově mechanice spojováno s existencí síly působící mezi oběma interagujícími tělesy.\r\n\r\nSíla není příčinou pohybu (jako příčina pohybu byla síla chápána v aristotelské filosofii přírody).\r\n\r\nPojem síly je zobecněn rozšířením o tzv. zdánlivé síly, které mají původ nikoli ve vzájemném působení těles, ale ve zrychleném pohybu vztažné soustavy, v níž polohu těles měříme.\r\n\r\nPojem síly je základním pojmem pro vektorovou formulaci mechaniky a elektrodynamiky. Analytická mechanika, teorie relativity ani kvantová teorie již z tohoto pojmu nevycházejí, avšak na základě analogie či principu korespondence umožňují sílu nebo její zobecnění vyjádřit.\r\n\r\nSíla je vektorovou veličinou. Síla působící na hmotný bod je vázaným vektorem, tj. působiště síly je v tomto bodě.",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 2,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_2EUI3f0.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 11,
      "grade": 11,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 15,
    "fields": {
      "name": "Teorie relativity",
      "description": "Teorie relativity je sada dvou fyzikálních teorií vytvořených Albertem Einsteinem: speciální teorie relativity (STR) a obecné teorie relativity (OTR). Tyto teorie si za cíl daly vysvětlit fakt, že elektromagnetické vlnění se nechová v souladu s Newtonovými pohybovými zákony. Lze ukázat, že elektromagnetické vlny se pohybují konstantní rychlostí bez ohledu na rychlost pozorovatele. Základní myšlenkou obou teorií je, že dva pozorovatelé, kteří se relativně vůči sobě pohybují, zjistí mezi danými dvěma událostmi různé časové i prostorové intervaly, přestože se na oba vztahují stejné fyzikální zákony. Teorie relativity patří mezi nejzákladnější (a nejúspěšnější) teorie moderní fyziky.\r\n\r\nTato teorie umožnila pochopit význam některých přírodních zákonitostí při rychlostech srovnatelných s rychlostí světla. Na principech použitých při formulaci teorie relativity pak vznikla celá relativistická fyzika, tedy fyzika studující především jevy probíhající při vysokých rychlostech. Např. relativistická mechanika se zabývá mechanickými jevy při vysokých rychlostech.\r\n\r\nHistorie\r\nHistoricky vznikla nejdříve tzv. speciální teorie relativity (1905), jejíž platnost je omezena pouze na inerciální vztažné soustavy. Později vznikla také obecná teorie relativity (1916), která umožnila popis relativistických jevů také v soustavách neinerciálních. Obecná teorie relativity umožnila pochopení vztahu mezi prostorem, časem a hmotou, což vedlo k formulaci Einsteinovy gravitační teorie. Do anglicky mluvícího světa ji šířil Arthur Eddington.[zdroj?]\r\n\r\nSledování jakéhokoli pohybu je vždy vztahováno k určité zvolené vztažné soustavě. Pokud bychom nebyli schopni určit vztažnou soustavu, nebyli bychom schopni rozhodnout, zda se pohybujeme. O pohybu nelze bez vztažné soustavy rozhodnout. Před vznikem teorie relativity existovala představa o existenci univerzální vztažné soustavy, tedy vztažné soustavy, která vyplňuje celý prostor, a k níž by bylo možné vztahovat veškerý pohyb. Tato soustava byla spojována s pojmem éter, o němž se předpokládalo, že je v klidu vůči prostoru, který vyplňuje. Experimenty, které se pokoušely určit relativní rychlost pohybu vůči éteru, však nebyly úspěšné. To vedlo ve svém důsledku k zavrhnutí existence univerzální vztažné soustavy a k představě, že k popisu fyzikálního děje lze zvolit libovolnou vztažnou soustavu, a také k závěru, že fyzikální zákony popisující dané děje mají ve všech vztažných soustavách stejný tvar.[zdroj?]\r\n\r\nTeorie relativity splňuje princip korespondence, tzn. aproximací relativistických vztahů pro malé rychlosti získáme klasické vztahy. To se projevuje např. při sčítání rychlostí apod. Také z obecné teorie relativity lze pro slabá pole získat Newtonův gravitační zákon.[1]\r\n\r\nSpeciální relativita\r\nPodrobnější informace naleznete v článku Speciální teorie relativity.\r\nVe svém článku z roku 1905 nazvaném „O elektrodynamice pohybujících se těles“ vytvořil Einstein speciální teorii relativity. Speciální relativita uvažuje pouze pozorovatele, kteří jsou v inerciálních vztažných soustavách, tzn. soustavách, které se navzájem pohybují rovnoměrně přímočaře. Takoví pozorovatelé pak podle této teorie nemohou pomocí žádného experimentu určit, který z nich je v „absolutním klidu“ a který z nich se oproti tomuto klidu „pohybuje“. Tato teorie postuluje, že rychlost světla ve vakuu je pro všechny takové pozorovatele stejná, nehledě na to, kterým směrem a jakou rychlostí se pozorovatelé pohybují.[zdroj?]\r\n\r\nJednou ze silných stránek speciální relativity je, že ji lze odvodit z pouhých dvou předpokladů:\r\n\r\nRychlost světla ve vakuu je konstantní.\r\nZákony fyziky jsou shodné pro všechny pozorovatele v inerciálních soustavách.\r\nObecná relativita\r\nPodrobnější informace naleznete v článku Obecná teorie relativity.\r\nObecná teorie relativity byla Einsteinem zveřejněna v roce 1916 (ovšem předtím ji v cyklu čtyř přednášek, konaných od 4. do 25. listopadu 1915, prezentoval před Pruskou akademií věd[2]). Je třeba podotknout, že před Einsteinem již vytvořil a zveřejnil některé rovnice německý matematik David Hilbert, což vedlo k opakovaným obviněním Einsteina z plagiátorství. Je však nepochybné, že v rovnicích, které se staly předmětem sporu, byla zachycena teorie, jejímž původcem byl Einstein a Hilbertovi ji objasnil při společných hovorech, které spolu vedli v létě 1915[3]. Oba muži pak v listopadu 1915 víceméně nezávisle, avšak s povědomím o práci kolegy, odvodili rovnice, které jsou vyjádřením této teorie. Teorie obecné relativity představuje rovnici, která nahrazuje Newtonův gravitační zákon. K vysvětlení gravitace používá matematické konstrukce diferenciální geometrie a tenzorů.[zdroj?]\r\n\r\nTeorie považuje za ekvivalentní všechny pozorovatele, nejenom ty, kteří se navzájem pohybují rovnoměrně přímočaře (proto „obecná“ oproti „speciální“), pro všechny platí stejné zákony obecné relativity, i když se pohybují se zrychlením. V obecné teorii relativity už gravitace není síla (jako v Newtonově gravitačním zákonu), ale je důsledkem zakřivení časoprostoru. Obecná relativita je geometrická teorie, která předpokládá, že přítomnost hmoty či energie „zakřivuje“ časoprostor a že toto zakřivení ovlivňuje dráhu těles (a dokonce i dráhu světla).[zdroj?]\r\n\r\nModerní využití\r\nObecná teorie relativity není jen pouhá teoretická koncepce, naopak má důležité důsledky pro praxi. Relativistické efekty ovlivňují například satelitní měření, kdy uživatel na Zemi je dle teorie relativity v jiném referenčním rámci. Podobně musí globální navigační systémy jako GPS, GLONASS a Galileo brát v potaz důsledky působení zemského gravitačního pole pro dosažení přesných výsledků měření. Přesné měření času taktéž. Přístroje počínaje elektronovým mikroskopem až po urychlovač částic by nefungovaly, kdyby opomenuly relativistické úvahy.[zdroj?]",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 3,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_NOZGVRJ.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 11,
      "grade": 11,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  },
  {
    "model": "eduklub.teachingunit",
    "pk": 16,
    "fields": {
      "name": "Supravodivost",
      "description": "Supravodivost je hustá, ale slyšel si o kvantovým tunelování? To je terpve haluz, když přijdeš na jak vlastně funguje termonukleární fúze, dojde ti, že jsme schopni pomocí hmotnosti získat skoro nekonečnej zdroj energie, dokud se to teda nepřemění na singularitu. Za to, že tohle čteš, máš bludišťáka a snad se nedostaneš za horizont událostí :-------)",
      "certificated": false,
      "creation_date": "2023-08-31",
      "number_of_lessons": 3,
      "number_of_downloads": 0,
      "zip_file": "teaching_units/zip_files/TESTOVACI_CELEK_fpBAchw.zip",
      "language": 1,
      "author": 2,
      "parent": null,
      "subject": 11,
      "grade": 17,
      "tags": [],
      "alternatives": [],
      "advice_urls": [],
      "guide_urls": []
    }
  }
]
